print("โปรมแกรมหาพื้นที่ 3 เหลื่ยม")
a = int(input('ใส่ค่าฐาน'))
b = int(input('ใส่ค่าสูง'))
c = 0.5 * a * b
print(f'ค่าพื้นที่ของ 3 เหลื่ยม = {c}\n')

print("โปรมแกรมหาพื้นที่ 4 เหลื่ยมจัตุรัส")
a = int(input('ใส่ค่าด้าน'))
c = a * a 
print(f'ค่าพื้นที่ของพื้นที่ 4 เหลื่ยมจัตุรัส = {c}\n')

print("โปรมแกรมหาพื้นที่ 4 เหลื่ยมผืนผ้า")
a = int(input('ใส่ค่ากว้าง'))
b = int(input('ใส่ค่ายาว'))
c = a * b
print(f'ค่าพื้นที่ของ 4 เหลื่ยมผืนผ้า ={c}\n')

print("โปรมแกรมหาพื้นที่วงกลม")
p = 3.14
b = int(input('ใส่ค่าฐาน'))
c = p * a * a
print(f'ค่าพื้นที่ของวงกลม = {c}\n')