import random

print('โปรแกรมเป่ายิงฉุบ')

while True:
    a = random.choice(["ค้อน", "กรรไกร", "กระดาษ"])
    print(f'คอมพิวเตอร์เลือก: {a}')

    print('เลือก ค้อน กรรไกร กระดาษ') 
    print('------------------------\n')
    b = input('คุณเลือก: ')
    
    if b == "ค้อน" and a == "กรรไกร":
        print("ผลลัพธ์คือ ชนะ")
    elif b == "กรรไกร" and a == "กระดาษ":
        print("ผลลัพธ์คือ ชนะ")
    elif b == "กระดาษ" and a == "ค้อน":
        print("ผลลัพธ์คือ ชนะ")
    elif b == a:
        print("ผลลัพธ์คือ เสมอ")
    else:
        print("ผลลัพธ์คือ แพ้")
    
    print('----------------------\n')
